app/Http/Controllers/bookingController.php

    public function index()
    {
        $id = auth()->user()->id ;
        $level = auth()->user()->level ;

         if($level=="Customer"):

                 return view('create',[
                "id_booking"=>"bookingnya",
                "post"=> booking::latest('status','Menunggu Konfirmasi')->filter(request(['search']))->paginate(10)->withQueryString(),
                "paket"=> paket::all(), ]);
---
SELECT * FROM `bookings` ORDER BY `status` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `bookings`
SELECT * FROM `pakets`

    public function cek(Request $request)
    {
      // dd($request);
       $paket = paket::find($request->paket);

        $jam = $paket->jumlah_jam;
        $nama_paket = $paket->nama_paket;
        $harga = $paket->harga;

        $sekarang=$request->jam_booking;
        $tgl_booking=$request->tgl_booking;
       $selisih=$jam;
       $nanti=date('H:i',strtotime($sekarang.' +'.$selisih.'hour'));
      // dd(date('H:i', strtotime($sekarang.'+'.$selisih.'hour')));


       $response = [
        'jam_booking'   =>  $sekarang,
        'jam_selsai'   =>  $nanti,
        'tgl_booking'   =>  $tgl_booking,
        'paket_id'   =>  $request->paket,
        ];


        //dd($request->tgl_booking);
        $tanggalan = booking::where('tgl_booking', $request->tgl_booking);

        if(booking::where('tgl_booking', '=', $request->tgl_booking)->count()  == null )
        {
            //dd("ooo");

            return redirect('/create')->with('success','Jam Tersedia! Silahkan Lakukan Pemesanan')->with([
                'jam_booking'   =>  $sekarang,
                'jam_selesai'   =>  $nanti,
                'nama_paket'   =>  $nama_paket,
                'tgl_booking'   =>  $tgl_booking,
                'harga'   =>  $harga,
                'paket_id'   =>  $request->paket,
             ]);
---
SELECT * FROM `pakets` WHERE `pakets`.`id` IS NULL LIMIT 1
SELECT count(*) as aggregate FROM `bookings` WHERE `tgl_booking` = '2023-07-28'
SELECT * FROM `bookings`


           // dd("foreach");

       if(booking::where('tgl_booking', '=', $request->tgl_booking)
       ->whereTime('jam_booking', '>=', $haha->jam_booking)
       ->whereTime('jam_selesai', '>=', $haha->jam_selesai)
                    ->first() == True) {
---
SELECT * FROM `bookings` WHERE `tgl_booking` = '2023-07-28' and time(`jam_booking`) >= '06:18' and time(`jam_selesai`) >= '12:18' LIMIT 1

    public function create()
    {

         return view('dashboard.booking.create', [
            'paket' => paket::all(),
            'customer' => customer::all(),
            'booking' => booking::all(),
        ]);
---
SELECT * FROM `pakets`
SELECT * FROM `customers`
SELECT * FROM `bookings`

    public function store(Request $request)
    {
        // return $request->file('bukti')->store('upload-bukti');
         //dd($request);
         $validatedData = $request->validate([
            'customer_id' => 'required',
            'paket_id' => 'required',
            'tgl_booking' => 'required',
            'jam_booking' => 'required',
            'jam_selesai' => 'required',
            'catatan' => 'required',
            'total' => 'required',
            'bukti' => 'required|file|max:2024',
            'status' => 'required'
        ]);

        if($request->file('bukti')){
            $validatedData['bukti']=$request->file('bukti')->store('upload-bukti');
        }
       // $validatedData['uang_lainnya'] = $request->lainnya;

       $level = auth()->user()->level;
       booking::create($validatedData);
---
INSERT INTO `bookings` (`customer_id`, `paket_id`, `tgl_booking`, `jam_booking`, `jam_selesai`, `catatan`, `total`, `bukti`, `status`, `updated_at`, `created_at`) VALUES ('11', '1', '2023-07-26', '06:25', '12:25', 'dawdawdawdawd', '30000000', 'upload-bukti/79dg2x9U7Ll7tlu8PCSX90kUXk99yhX5Kas5iJG4.png', 'Menunggu Konfirmasi', '2023-07-18 19:22:12', '2023-07-18 19:22:12')

    public function update(Request $request, booking $booking)
    {
        //dd($request);
        $rules = [
            'customer_id' => 'required',
            'tgl_booking' => 'required',
            'paket_id' => 'required',
            'jam_booking' => 'required',
            'jam_selesai' => 'required',
            'status' => 'required'
        ];



        if($request->file('bukti')) {
            $validatedData['bukti'] = $request->file('bukti')->store('upload-bukti');
        }

        $validatedData = $request->validate($rules);

        booking::where('id',$booking->id)
        ->update($validatedData);
---
UPDATE `bookings` SET `customer_id` = '11', `tgl_booking` = '2023-07-28', `paket_id` = '1', `jam_booking` = '06:18', `jam_selesai` = '12:18', `status` = 'Konfirmasi', `bookings`.`updated_at` = '2023-07-18 19:25:25' WHERE `id` = 1

    public function laporan()
    {
        $id = auth()->user()->id ;
        return view('dashboard.booking.laporan',[
       "id_booking"=>"bookingnya",
       "customer"=> customer::all()]);
---
SELECT * FROM `customers`