app/Http/Controllers/customerController.php

SELECT * FROM `customers` ORDER BY `created_at` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `customers`
---
    public function index()
    {
          return view('dashboard.customer.index',[
            "id_customer"=>"customernya",

            "post"=> customer::latest()->filter(request(['search']))->paginate(5)->withQueryString()
    ]);

SELECT * FROM `pakets`
SELECT * FROM `users`
---
    public function registrasi()
    {
        //
       return view('registrasi', [
            'paket' => paket::all(),
            'user' => user::all()
        ]);