app/Http/Controllers/galeryController.php

SELECT * FROM `galeries`
---
    public function galeryhome()
    {
        return view('galery',[
            "id_galery"=>"galerynya",
            "post"=> galery::all(),
            "postper"=> galery::all(),
            ]);

SELECT * FROM `galeries` ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `galeries`
SELECT * FROM `galeries`
---
    public function index()
    {
        //dd(auth()->user()->level) ;
        //dd(Auth::guest());
        if(Auth::guest()==true):

            return view('galery',[
                "id_galery"=>"galerynya",
                "post"=> galery::latest()->filter(request(['search']))->paginate(10)->withQueryString(),
                "postper"=> galery::latest()->filter(request(['search']))->paginate(10)->withQueryString(),
                ]);

        elseif(auth()->user()->level=="Administrator"):

            return view('dashboard.galery.index',[
                "id_galery"=>"galerynya",
                "post"=> galery::latest()->paginate(10)->withQueryString(),
                "postper"=> galery::all()
                     ]);

SELECT * FROM `galeries`
---
    public function create()
    {
        //
         return view('dashboard.galery.create', [
            'periodecek' => galery::all(),

        ]);