app/Http/Controllers/homeController.php

SELECT count(id) sum, DATE_FORMAT(tgl_booking, '%d %M %Y') tgl_booking FROM `bookings` WHERE `status` = 'Konfirmasi' and `tgl_booking` >= '2023-07-18 00:00:00 00:00:00' and `tgl_booking` <= '2023-07-25 00:00:00 23.59.59' GROUP BY `tgl_booking`
---
    public function dashboard()
    {
        $date = Carbon::now()->subDays(7);
        $startDate = Carbon::today();
        $endDate = Carbon::today()->addDays(7);

        $id = auth()->user()->id ;
         return view('dashboard.home',[
          //  "created" => booking::groupby(date('created_at'))->where('created_at', '>=',  $date)->get(),
            "created" => booking::where('created_at', '>=',  $date)->get(),
            "graf" => DB::table('bookings')
            ->selectRaw("count(id) sum, DATE_FORMAT(tgl_booking, '%d %M %Y') tgl_booking")
            ->where('status','Konfirmasi')
            ->where('tgl_booking', '>=', $startDate.' 00:00:00')
            ->where('tgl_booking', '<=', $endDate.' 23.59.59')
            ->groupBy('tgl_booking')
            ->get(),