app/Http/Controllers/paketController.php

SELECT * FROM `pakets`
---
    public function create()
    {
        //
         return view('dashboard.paket.create', [
            'periodecek' => paket::all(),

        ]);

INSERT INTO `pakets` (`nama_paket`, `harga`, `jumlah_jam`, `keterangan`, `foto`, `updated_at`, `created_at`) VALUES ('Wedding', '30000000', '6', '-wadawd\r\n-wadaw\r\n-awdad', 'upload-foto/NwpJ2F0wqHZUPhxZXIiVtmrGAJ3SgTPteOdWSk3m.jpg', '2023-07-18 19:07:07', '2023-07-18 19:07:07')
---
    public function store(Request $request)
    {
        // return $request->file('foto')->store('upload-foto');
         //dd($request);
        $validatedData = $request->validate([
            'nama_paket' => 'required',
            'harga' => 'required',
            'jumlah_jam' => 'required',
            'keterangan' => 'required',
            'foto' => 'required|file|max:2024',
        ]);

         if($request->file('foto')){
            $validatedData['foto']=$request->file('foto')->store('upload-foto');
        }

        //ddd($validatedData);
        paket::create($validatedData);

SELECT * FROM `pakets`
---
    public function paket()
    {


            return view('paket',[
                "id_booking"=>"bookingnya",
                "post"=> paket::all(),
                ]);