app/Http/Controllers/profilController.php

    public function index()
    {
        //

         return view('profil.index',[
            "id_profil"=>"profilnya",

            "post"=> profil::all() ,
            "team"=> team::all()
         ]);
---
SELECT * FROM `profils`
SELECT * FROM `teams`