app/Http/Controllers/rekeningController.php

SELECT * FROM `rekenings` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `rekenings`
---
    public function index()
    {
        //$id = auth()->user()->id ;
         return view('dashboard.rekening.index',[
        "id"=>"rekeningnya",
        "post"=> rekening::latest()->filter(request(['search']))->paginate(6)->withQueryString(),


    ]);