app/Http/Controllers/teamController.php

SELECT * FROM `teams` ORDER BY `created_at` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `teams`
---
    public function index()
    {
        //$id = auth()->user()->level ;

        if(Auth::guest()==true):

            return view('team',[
                "id_team"=>"teamnya",
                "post"=> team::latest()->paginate(10)->withQueryString(),
                "postper"=> team::all()
                ]);

        elseif(auth()->user()->level=="Administrator"):

            return view('dashboard.team.index',[
                "id_team"=>"teamnya",
                "post"=> team::latest()->filter(request(['search']))->paginate(5)->withQueryString(),
                "postper"=> team::all()
                     ]);

SELECT * FROM `teams`
---
    public function create()
    {
        //
         return view('dashboard.team.create', [
            'periodecek' => team::all(),

        ]);

SELECT * FROM `teams`
---
    public function edit(team $team)
    {
        //
         return view('dashboard.team.edit',[
            'team' => team::all(),
              'team'=> $team
          ]);

UPDATE `teams` SET `nama` = 'M. Zahlan Nugraha', `jk` = 'Laki-Laki', `telepon` = '0895611621628', `alamat` = 'Kbn. Kopi', `tempat_lahir` = 'Jambi', `tanggal_lahir` = '2001-01-03', `posisi` = 'Founder/Photographer', `foto` = 'upload-foto/qn0zvUU6eavyn4Sy9z7hXG1xUU8JbW63r7ZGXoX4.jpg', `teams`.`updated_at` = '2023-07-18 18:37:41' WHERE `id` = 6
---
    public function update(Request $request, team $team)
    {
        //dd($request);
        $rules = [
            'nama' => 'required',
            'jk' => 'required',
            'telepon' => 'required',
            'alamat' => 'required',
            'tempat_lahir' => 'required',
            'tanggal_lahir' => 'required',
            'posisi' => 'required',
        ];




        $validatedData = $request->validate($rules);

        if($request->file('foto')) {

            $validatedData['foto'] = $request->file('foto')->store('upload-foto');
        }


        team::where('id',$team->id)
        ->update($validatedData);